public_html/Emacs/config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs24安装与配置</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Emacs24安装与配置"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-01-12 16:54"/>
<meta name="author" content="wchunx "/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link href="../css/org.css" rel="stylesheet" type="text/css">
<link href="../css/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../css/bootstrap-responsive.min.css" rel="stylesheet">

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../sitemap.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Emacs24安装与配置</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 安装Emacs24.3.1</a>
<ul>
<li><a href="#sec-1-1">1.1 卸载Emacs23</a></li>
<li><a href="#sec-1-2">1.2 安装Emacs24.3.1</a></li>
</ul>
</li>
<li><a href="#sec-2">2 安装ecb</a>
<ul>
<li><a href="#sec-2-1">2.1 ecb布局</a></li>
<li><a href="#sec-2-2">2.2 参考资料</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Emacs多窗口操作</a>
<ul>
<li><a href="#sec-3-1">3.1 典型的工作流</a></li>
<li><a href="#sec-3-2">3.2 将子窗口自动编号,然后按M-0…9跳转(最爱)</a></li>
<li><a href="#sec-3-3">3.3 undo/redo之前的窗口操作</a></li>
<li><a href="#sec-3-4">3.4 光标移动到下一窗口(常用)</a></li>
<li><a href="#sec-3-5">3.5 水平/垂直切分当前窗口(常用)</a></li>
<li><a href="#sec-3-6">3.6 将当前子窗口最大化(常用)</a></li>
<li><a href="#sec-3-7">3.7 删除当前子窗口(偶尔用)</a></li>
<li><a href="#sec-3-8">3.8 移动光标到上下左右的窗口(基本不用)</a></li>
<li><a href="#sec-3-9">3.9 存储/载入窗口布局到register(基本不用)</a>
<ul>
<li><a href="#sec-3-9-1">3.9.1 参考资料</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4">4 Python环境配置</a>
<ul>
<li><a href="#sec-4-1">4.1 参考资料</a></li>
</ul>
</li>
<li><a href="#sec-5">5 GTD</a></li>
<li><a href="#sec-6">6 Emacs配置参考</a></li>
<li><a href="#sec-7">7 使用问题</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 安装Emacs24.3.1</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 卸载Emacs23</h3>
<div class="outline-text-3" id="text-1-1">




<pre class="src src-sh">sudo apt-get purge emacs23* emacs23-bin-common* emacs23-common* emacsen-common &amp;&amp; sudo apt-get autoremove
</pre>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 安装Emacs24.3.1</h3>
<div class="outline-text-3" id="text-1-2">

<p>PPA方式
</p>


<pre class="src src-sh">sudo add-apt-repository ppa:cassou/emacs
sudo apt-get update
sudo apt-get install emacs24 emacs24-el emacs24-common-non-dfsg
</pre>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 安装ecb</h2>
<div class="outline-text-2" id="text-2">

<p>ecb是emacs中的代码浏览工具，依赖cedet。cedet使用Emacs24.3.1自带的。
clone的<a href="http://alexott.blogspot.de/2012/06/ecb-fresh-emacscedet.html">这篇文章</a> 作者的ecb代码。
</p>


<pre class="src src-sh"><span style="color: #859900;">cd</span> ~/.emacs.d/plugins/
git clone https://github.com/alexott/ecb/
</pre>

<p>
init.el中ecb的配置
</p>


<pre class="src src-elisp"><span style="color: #586e75; font-style: italic;">;;</span><span style="color: #586e75; font-style: italic;">cedet</span>
(<span style="color: #859900;">require</span> '<span style="color: #2aa198;">semantic</span>)
(<span style="color: #859900;">require</span> '<span style="color: #2aa198;">semantic/sb</span>)
(<span style="color: #859900;">require</span> '<span style="color: #2aa198;">srecode</span>)
(global-ede-mode 1)
(semantic-mode 1)
<span style="color: #586e75; font-style: italic;">;;</span><span style="color: #586e75; font-style: italic;">ecb</span>
(add-to-list 'load-path <span style="color: #2aa198;">"~/.emacs.d/plugins/ecb"</span>)
(<span style="color: #859900;">require</span> '<span style="color: #2aa198;">ecb</span>)
(setq stack-trace-on-error nil)
<span style="color: #586e75; font-style: italic;">;;</span><span style="color: #586e75; font-style: italic;">&#40736;&#26631;&#25903;&#25345;&#65306;Emacs&#20013;&#25191;&#34892;&#8220;M-x ecb-customize-most-important&#8221;&#65292;&#25214;&#21040;&#8220;Ecb Primary Secondary Mouse Buttons&#8221;&#36873;&#39033;&#65292;&#23558;&#20854;&#35774;&#20026;&#8220;Primary: mouse-1, secondary: mouse-2&#8221;&#65292;&#24182;&#19988;&gt;&#20197;&#8220;Save for Future Sessions&#8221;&#20445;&#23384;&#12290;</span>
<span style="color: #586e75; font-style: italic;">;;</span><span style="color: #586e75; font-style: italic;">&#33258;&#21160;&#21551;&#21160;ecb</span>
<span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">(setq ecb-auto-activate t)</span>
<span style="color: #586e75; font-style: italic;">;;</span><span style="color: #586e75; font-style: italic;">F7:&#25171;&#24320;ecb</span>
(global-set-key  [(f7)] 'ecb-activate)
<span style="color: #586e75; font-style: italic;">;;</span><span style="color: #586e75; font-style: italic;">F8:&#20851;&#38381;ecb</span>
(global-set-key  [(f8)] 'ecb-deactivate)
<span style="color: #586e75; font-style: italic;">;;</span><span style="color: #586e75; font-style: italic;">&#20851;&#38381;ecb&#21551;&#21160;&#31383;&#21475;</span>
(setq ecb-tip-of-the-day nil)
</pre>


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> ecb布局</h3>
<div class="outline-text-3" id="text-2-1">

<p><a href="http://blog.yxwang.me/2010/02/bind-cscope-to-ecb/">ecb和cscope的结合使用</a> <br/>
<a href="http://utkarshsengar.com/2011/06/emacs-python/">My emacs setup for python dev</a> <br/>
</p></div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 参考资料</h3>
<div class="outline-text-3" id="text-2-2">

<p>关于内置cedet的配置这几篇介绍不错 <br/>
<a href="http://stackoverflow.com/questions/8038114/emacs-24-builtin-cedet-function-highlight">http://stackoverflow.com/questions/8038114/emacs-24-builtin-cedet-function-highlight</a> <br/>
<a href="http://www.cnblogs.com/zfreay#sec-2.2">http://www.cnblogs.com/zfreay#sec-2.2</a> <br/>
<a href="http://emacser.com/built-in-cedet.htm">http://emacser.com/built-in-cedet.htm</a>
</p>
<p>
cedet的详细说明 <br/>
<a href="http://cxwangyi.wordpress.com/2010/08/21/using-cedet-with-emacs/">http://cxwangyi.wordpress.com/2010/08/21/using-cedet-with-emacs/</a> <br/>
<a href="http://alexott.net/en/writings/emacs-devenv/EmacsCedet.html">http://alexott.net/en/writings/emacs-devenv/EmacsCedet.html</a>
</p>
<p>
<a href="http://jinganglang777.blog.163.com/blog/static/790854972012127104446221/">让Emacs功能强于Source Insight</a> <br/>
<a href="http://www.wolinlabs.com/blog/emacs.global.speedbar.html">Code Browsing with Emacs, GLOBAL, and Speedbar</a>
</p></div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Emacs多窗口操作</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 典型的工作流</h3>
<div class="outline-text-3" id="text-3-1">

<ol>
<li>在两个子窗口中对比文件内容
</li>
<li>打开更多的窗口以参考其他信息.
</li>
<li>对某个窗口内容比较有兴趣,跳转到该窗口,将该窗口最大化
</li>
<li>看完最大化的窗口内容后,undo最大化操作,重新回到早先的多个小窗口模式以便继续纵览全局
</li>
</ol>

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 将子窗口自动编号,然后按M-0…9跳转(最爱)</h3>
<div class="outline-text-3" id="text-3-2">

<p>安装<a href="https://github.com/nschum/window-numbering.el">window-numbering.el</a> ,然后在.emacs中添加以下代码,
</p>


<pre class="src src-sh">(require <span style="color: #2aa198;">'window-numbering)</span>
<span style="color: #2aa198;">(window-numbering-mode 1)</span>
</pre>

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> undo/redo之前的窗口操作</h3>
<div class="outline-text-3" id="text-3-3">

<p>使用winer-mode,默认C-c &lt;left&gt;和C-c &lt;right&gt;来对窗口布局实现undo/redo, .emacs中添加
</p>


<pre class="src src-sh">(winner-mode t)
</pre>

</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 光标移动到下一窗口(常用)</h3>
<div class="outline-text-3" id="text-3-4">

<p>M-x other-window,快捷键是`C-x o`.
</p></div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> 水平/垂直切分当前窗口(常用)</h3>
<div class="outline-text-3" id="text-3-5">

<p>快捷键C-x 2/3
</p></div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> 将当前子窗口最大化(常用)</h3>
<div class="outline-text-3" id="text-3-6">

<p>M-x delete-other-windows,快捷键`C-x 1`.
</p></div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> 删除当前子窗口(偶尔用)</h3>
<div class="outline-text-3" id="text-3-7">

<p>M-x delete-window,快捷键`C-x 0`.
</p></div>

</div>

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> 移动光标到上下左右的窗口(基本不用)</h3>
<div class="outline-text-3" id="text-3-8">

<p>因我较喜欢vi快捷键,所以我安装了Evil Mode.快捷键和Vi一样.C-w h/j/k/l移动至各方向的子窗口.
</p></div>

</div>

<div id="outline-container-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> 存储/载入窗口布局到register(基本不用)</h3>
<div class="outline-text-3" id="text-3-9">

<p>`C-x r w &lt;register&gt;`存储,`C-x r j &lt;register&gt;`载入.
</p>
</div>

<div id="outline-container-3-9-1" class="outline-4">
<h4 id="sec-3-9-1"><span class="section-number-4">3.9.1</span> 参考资料</h4>
<div class="outline-text-4" id="text-3-9-1">

<p><a href="http://blog.csdn.net/redguardtoo/article/details/7768233">Emacs中的完美多窗口操作 </a>
</p>
<p>
<a href="http://www.cnblogs.com/bamanzi/archive/2011/08/20/some-emacs-window-utils.html">Emacs窗口管理几个好东东</a>
</p></div>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Python环境配置</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 参考资料</h3>
<div class="outline-text-3" id="text-4-1">

<p><a href="http://tkf.github.io/emacs-jedi/">主要参考1</a> <br/>
<a href="http://caisah.info/emacs-for-python/">主要参考2</a> <br/>
<a href="https://code.djangoproject.com/wiki/Emacs">django配置</a> <br/>
<a href="http://jack-kelly.com/setting_up_emacs_for_python_development">Setting up Emacs for Python development </a> <br/>
</p></div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <a href="http://cnlox.is-programmer.com/posts/10354.html">GTD</a></h2>
<div class="outline-text-2" id="text-5">

</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Emacs配置参考</h2>
<div class="outline-text-2" id="text-6">

<p><a href="http://www.cinsk.org/emacs/emacs-artist.html">Emacs画图Artist Mode</a> <br/>
<a href="http://lifegoo.pluskid.org/wiki/Emacs.html">星黎殿</a> <br/>
<a href="http://forum.ubuntu.org.cn/viewtopic.php?t=136768">emacs推广，配置详细介绍</a> <br/>
<a href="http://blog.csdn.net/jinzhuojun/article/details/1786451">程序员的emacs配置大全(cedet+ecb+cscope+gdb-ui)-jzj </a>
</p></div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 使用问题</h2>
<div class="outline-text-2" id="text-7">

<p>1.安装ELPA包管理器并安装扩展，Emacs启动报错“cannot open load file” for ~/.emacs.d/elpa/archives/-pkg
</p>
<p>
解决办法：touch ~/.emacs.d/elpa/archives/-pkg
</p>
<p>
2.启动Emacs报错Symbol's function definition is void: loop
</p>
<p>
解决办法：.emacs添加 (require 'cl)
</p>
<p>
3.Emacs23中去掉工具栏菜单栏和滚动条的配置
</p>


<pre class="src src-elisp">(tool-bar-mode nil)
(menu-bar-mode nil)
(scroll-bar-mode nil)
</pre>

<p>
Emacs24中上面的设置是无效的，需要改为
</p>


<pre class="src src-elisp">(tool-bar-mode 0)
(menu-bar-mode 0)
(scroll-bar-mode 0)
</pre>

<p>
4.flet和labels的warning.装完auto-compute，启动emacs总会出下面两条warning
</p>


<pre class="src src-sh"><span style="color: #fa8072;">`flet' is an obsolete macro (as of 24.3); use either `</span>cl-flet<span style="color: #2aa198;">' or `cl-letf'</span>.
<span style="color: #fa8072;">`labels' is an obsolete macro (as of 24.3); use `</span>cl-labels<span style="color: #2aa198;">' instead.</span>
</pre>

<p>
<a href="http://ergoemacs.org/emacs/emacs_24_common_lisp_package_name_change.html">这里</a> 有点介绍.
5.打开c文件报错:wrong-type-argument stringp 1
</p>
<p>
解决办法：安装g++,参考<a href="http://www.cnblogs.com/machine/archive/2012/11/20/2779621.html">1</a>
</p></div>
</div>
</div>

<div id="postamble">
    <p class="postamble">Last Updated 2014-01-12 16:54.</p> 
</div>
</body>
</html>
